- Задайте двумерный массив. Напишите программу, которая поменяет местами первую и последнюю строку массива.

- Задайте двумерный массив. Напишите программу, которая заменяет строки на столбцы. В случае, если это невозможно, программа должна вывести сообщение для пользователя.

- Задайте двумерный массив из целых чисел. Напишите программу, которая удалит строку и столбец, на пересечении которых расположен наименьший элемент массива.


- Вывести первые N строк треугольника Паскаля. Сделать вывод в виде равнобедренного треугольника
